In [ ]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine(
    "postgresql+psycopg://hc:hc_password@localhost:5432/homecredit"
)

pd.read_sql("SELECT 1 AS ok;", engine)

In [4]:
import pandas as pd
df_app = pd. read_parquet('../data/processed/application_train_clean.parquet')

In [5]:
df_app.head()

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,...,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR,AGE_YEARS,AGE_OUTLIER,INCOME_OUTLIER,CREDIT_OUTLIER
0,100002,1,Cash loans,M,N,Y,0,202500.0,406597.5,24700.5,...,0.0,0.0,0.0,0.0,0.0,1.0,25.9,0,0,0
1,100003,0,Cash loans,F,N,N,0,270000.0,1293502.5,35698.5,...,0.0,0.0,0.0,0.0,0.0,0.0,45.9,0,0,0
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,135000.0,6750.0,...,0.0,0.0,0.0,0.0,0.0,0.0,52.1,0,0,0
3,100006,0,Cash loans,F,N,Y,0,135000.0,312682.5,29686.5,...,NaN,NaN,NaN,NaN,NaN,NaN,52.0,0,0,0
4,100007,0,Cash loans,M,N,Y,0,121500.0,513000.0,21865.5,...,0.0,0.0,0.0,0.0,0.0,0.0,54.6,0,0,0

In [18]:
df_app.dtypes.to_string()

'SK_ID_CURR                         Int64\nTARGET                              int8\nNAME_CONTRACT_TYPE              category\nCODE_GENDER                     category\nFLAG_OWN_CAR                    category\nFLAG_OWN_REALTY                 category\nCNT_CHILDREN                       int64\nAMT_INCOME_TOTAL                 float64\nAMT_CREDIT                       float64\nAMT_ANNUITY                      float64\nAMT_GOODS_PRICE                  float64\nNAME_TYPE_SUITE                 category\nNAME_INCOME_TYPE                category\nNAME_EDUCATION_TYPE             category\nNAME_FAMILY_STATUS              category\nNAME_HOUSING_TYPE               category\nREGION_POPULATION_RELATIVE       float64\nDAYS_BIRTH                         int64\nDAYS_EMPLOYED                      int64\nDAYS_REGISTRATION                float64\nDAYS_ID_PUBLISH                    int64\nOWN_CAR_AGE                      float64\nFLAG_MOBIL                          int8\nFLAG_EMP_PHONE                      int8\nFLAG_WORK_PHONE                     int8\nFLAG_CONT_MOBILE                    int8\nFLAG_PHONE                          int8\nFLAG_EMAIL                          int8\nOCCUPATION_TYPE                 category\nCNT_FAM_MEMBERS                  float64\nREGION_RATING_CLIENT               int64\nREGION_RATING_CLIENT_W_CITY        int64\nWEEKDAY_APPR_PROCESS_START      category\nHOUR_APPR_PROCESS_START            int64\nREG_REGION_NOT_LIVE_REGION         int64\nREG_REGION_NOT_WORK_REGION         int64\nLIVE_REGION_NOT_WORK_REGION        int64\nREG_CITY_NOT_LIVE_CITY             int64\nREG_CITY_NOT_WORK_CITY             int64\nLIVE_CITY_NOT_WORK_CITY            int64\nORGANIZATION_TYPE               category\nEXT_SOURCE_1                     float64\nEXT_SOURCE_2                     float64\nEXT_SOURCE_3                     float64\nAPARTMENTS_AVG                   float64\nBASEMENTAREA_AVG                 float64\nYEARS_BEGINEXPLUATATION_AVG      float64\nYEARS_BUILD_AVG                  float64\nCOMMONAREA_AVG                   float64\nELEVATORS_AVG                    float64\nENTRANCES_AVG                    float64\nFLOORSMAX_AVG                    float64\nFLOORSMIN_AVG                    float64\nLANDAREA_AVG                     float64\nLIVINGAPARTMENTS_AVG             float64\nLIVINGAREA_AVG                   float64\nNONLIVINGAPARTMENTS_AVG          float64\nNONLIVINGAREA_AVG                float64\nAPARTMENTS_MODE                  float64\nBASEMENTAREA_MODE                float64\nYEARS_BEGINEXPLUATATION_MODE     float64\nYEARS_BUILD_MODE                 float64\nCOMMONAREA_MODE                  float64\nELEVATORS_MODE                   float64\nENTRANCES_MODE                   float64\nFLOORSMAX_MODE                   float64\nFLOORSMIN_MODE                   float64\nLANDAREA_MODE                    float64\nLIVINGAPARTMENTS_MODE            float64\nLIVINGAREA_MODE                  float64\nNONLIVINGAPARTMENTS_MODE         float64\nNONLIVINGAREA_MODE               float64\nAPARTMENTS_MEDI                  float64\nBASEMENTAREA_MEDI                float64\nYEARS_BEGINEXPLUATATION_MEDI     float64\nYEARS_BUILD_MEDI                 float64\nCOMMONAREA_MEDI                  float64\nELEVATORS_MEDI                   float64\nENTRANCES_MEDI                   float64\nFLOORSMAX_MEDI                   float64\nFLOORSMIN_MEDI                   float64\nLANDAREA_MEDI                    float64\nLIVINGAPARTMENTS_MEDI            float64\nLIVINGAREA_MEDI                  float64\nNONLIVINGAPARTMENTS_MEDI         float64\nNONLIVINGAREA_MEDI               float64\nFONDKAPREMONT_MODE              category\nHOUSETYPE_MODE                  category\nTOTALAREA_MODE                   float64\nWALLSMATERIAL_MODE              category\nEMERGENCYSTATE_MODE             category\nOBS_30_CNT_SOCIAL_CIRCLE         float64\nDEF_30_CNT_SOCIAL_CIRCLE         float64\nOBS_60_CNT_SOCIAL_CIRCLE         float64\nDEF_60_CNT_SOCIAL_CIRCLE         float64\nDAYS_LAST_PHONE_CHANGE           float64\nFLAG_DOCUMENT_2                     int8\nFLAG_DOCUMENT_3                     int8\nFLAG_DOCUMENT_4                     int8\nFLAG_DOCUMENT_5                     int8\nFLAG_DOCUMENT_6                     int8\nFLAG_DOCUMENT_7                     int8\nFLAG_DOCUMENT_8                     int8\nFLAG_DOCUMENT_9                     int8\nFLAG_DOCUMENT_10                    int8\nFLAG_DOCUMENT_11                    int8\nFLAG_DOCUMENT_12                    int8\nFLAG_DOCUMENT_13                    int8\nFLAG_DOCUMENT_14                    int8\nFLAG_DOCUMENT_15                    int8\nFLAG_DOCUMENT_16                    int8\nFLAG_DOCUMENT_17                    int8\nFLAG_DOCUMENT_18                    int8\nFLAG_DOCUMENT_19                    int8\nFLAG_DOCUMENT_20                    int8\nFLAG_DOCUMENT_21                    int8\nAMT_REQ_CREDIT_BUREAU_HOUR       float64\nAMT_REQ_CREDIT_BUREAU_DAY        float64\nAMT_REQ_CREDIT_BUREAU_WEEK       float64\nAMT_REQ_CREDIT_BUREAU_MON        float64\nAMT_REQ_CREDIT_BUREAU_QRT        float64\nAMT_REQ_CREDIT_BUREAU_YEAR       float64\nAGE_YEARS                        float64\nAGE_OUTLIER                         int8\nINCOME_OUTLIER                      int8\nCREDIT_OUTLIER                      int8'

In [12]:
col_types = (
    df_app.dtypes
    .reset_index()
    .rename(columns={"index": "column", 0: "pandas_dtype"})
)

col_types.head(10)

               column pandas_dtype
0          SK_ID_CURR        Int64
1              TARGET         int8
2  NAME_CONTRACT_TYPE     category
3         CODE_GENDER     category
4        FLAG_OWN_CAR     category
5     FLAG_OWN_REALTY     category
6        CNT_CHILDREN        int64
7    AMT_INCOME_TOTAL      float64
8          AMT_CREDIT      float64
9         AMT_ANNUITY      float64

In [13]:
def classify_dtype(dtype):
    if "int" in str(dtype) or "float" in str(dtype):
        return "numeric"
    if dtype.name == "category":
        return "categorical"
    return "other"

col_types["semantic_type"] = col_types["pandas_dtype"].apply(classify_dtype)

In [14]:
col_types["semantic_type"].value_counts()

semantic_type
numeric        109
categorical     16
other            1
Name: count, dtype: int64

In [15]:
col_types[col_types["semantic_type"] == "numeric"]

                         column pandas_dtype semantic_type
1                        TARGET         int8       numeric
6                  CNT_CHILDREN        int64       numeric
7              AMT_INCOME_TOTAL      float64       numeric
8                    AMT_CREDIT      float64       numeric
9                   AMT_ANNUITY      float64       numeric
..                          ...          ...           ...
121  AMT_REQ_CREDIT_BUREAU_YEAR      float64       numeric
122                   AGE_YEARS      float64       numeric
123                 AGE_OUTLIER         int8       numeric
124              INCOME_OUTLIER         int8       numeric
125              CREDIT_OUTLIER         int8       numeric

[109 rows x 3 columns]

In [16]:
col_types[col_types["semantic_type"] == "categorical"]

                        column pandas_dtype semantic_type
2           NAME_CONTRACT_TYPE     category   categorical
3                  CODE_GENDER     category   categorical
4                 FLAG_OWN_CAR     category   categorical
5              FLAG_OWN_REALTY     category   categorical
11             NAME_TYPE_SUITE     category   categorical
12            NAME_INCOME_TYPE     category   categorical
13         NAME_EDUCATION_TYPE     category   categorical
14          NAME_FAMILY_STATUS     category   categorical
15           NAME_HOUSING_TYPE     category   categorical
28             OCCUPATION_TYPE     category   categorical
32  WEEKDAY_APPR_PROCESS_START     category   categorical
40           ORGANIZATION_TYPE     category   categorical
86          FONDKAPREMONT_MODE     category   categorical
87              HOUSETYPE_MODE     category   categorical
89          WALLSMATERIAL_MODE     category   categorical
90         EMERGENCYSTATE_MODE     category   categorical

In [17]:
def map_to_sql(dtype):
    if dtype.name == "category":
        return "VARCHAR"
    if "Int" in str(dtype):
        return "BIGINT"
    if "int" in str(dtype):
        return "INTEGER"
    if "float" in str(dtype):
        return "DOUBLE PRECISION"
    return "TEXT"

col_types["sql_type"] = col_types["pandas_dtype"].apply(map_to_sql)

In [20]:
col_types[["column", "pandas_dtype", "sql_type"]].head(50)

                         column pandas_dtype          sql_type
0                    SK_ID_CURR        Int64            BIGINT
1                        TARGET         int8           INTEGER
2            NAME_CONTRACT_TYPE     category           VARCHAR
3                   CODE_GENDER     category           VARCHAR
4                  FLAG_OWN_CAR     category           VARCHAR
5               FLAG_OWN_REALTY     category           VARCHAR
6                  CNT_CHILDREN        int64           INTEGER
7              AMT_INCOME_TOTAL      float64  DOUBLE PRECISION
8                    AMT_CREDIT      float64  DOUBLE PRECISION
9                   AMT_ANNUITY      float64  DOUBLE PRECISION
10              AMT_GOODS_PRICE      float64  DOUBLE PRECISION
11              NAME_TYPE_SUITE     category           VARCHAR
12             NAME_INCOME_TYPE     category           VARCHAR
13          NAME_EDUCATION_TYPE     category           VARCHAR
14           NAME_FAMILY_STATUS     category           VARCHAR
15            NAME_HOUSING_TYPE     category           VARCHAR
16   REGION_POPULATION_RELATIVE      float64  DOUBLE PRECISION
17                   DAYS_BIRTH        int64           INTEGER
18                DAYS_EMPLOYED        int64           INTEGER
19            DAYS_REGISTRATION      float64  DOUBLE PRECISION
20              DAYS_ID_PUBLISH        int64           INTEGER
21                  OWN_CAR_AGE      float64  DOUBLE PRECISION
22                   FLAG_MOBIL         int8           INTEGER
23               FLAG_EMP_PHONE         int8           INTEGER
24              FLAG_WORK_PHONE         int8           INTEGER
25             FLAG_CONT_MOBILE         int8           INTEGER
26                   FLAG_PHONE         int8           INTEGER
27                   FLAG_EMAIL         int8           INTEGER
28              OCCUPATION_TYPE     category           VARCHAR
29              CNT_FAM_MEMBERS      float64  DOUBLE PRECISION
30         REGION_RATING_CLIENT        int64           INTEGER
31  REGION_RATING_CLIENT_W_CITY        int64           INTEGER
32   WEEKDAY_APPR_PROCESS_START     category           VARCHAR
33      HOUR_APPR_PROCESS_START        int64           INTEGER
34   REG_REGION_NOT_LIVE_REGION        int64           INTEGER
35   REG_REGION_NOT_WORK_REGION        int64           INTEGER
36  LIVE_REGION_NOT_WORK_REGION        int64           INTEGER
37       REG_CITY_NOT_LIVE_CITY        int64           INTEGER
38       REG_CITY_NOT_WORK_CITY        int64           INTEGER
39      LIVE_CITY_NOT_WORK_CITY        int64           INTEGER
40            ORGANIZATION_TYPE     category           VARCHAR
41                 EXT_SOURCE_1      float64  DOUBLE PRECISION
42                 EXT_SOURCE_2      float64  DOUBLE PRECISION
43                 EXT_SOURCE_3      float64  DOUBLE PRECISION
44               APARTMENTS_AVG      float64  DOUBLE PRECISION
45             BASEMENTAREA_AVG      float64  DOUBLE PRECISION
46  YEARS_BEGINEXPLUATATION_AVG      float64  DOUBLE PRECISION
47              YEARS_BUILD_AVG      float64  DOUBLE PRECISION
48               COMMONAREA_AVG      float64  DOUBLE PRECISION
49                ELEVATORS_AVG      float64  DOUBLE PRECISION